/**********************************************************************************************************
회원가입
**********************************************************************************************************/

-- 1. 아이디가 중복값이 있는지 (select)
SELECT * FROM tbl_user WHERE user_id = 'qew032';

-- 2. 회원 가입 (insert)
INSERT INTO `tbl_user` (`user_id`, `user_pw`, `user_nm`, `user_phnum`, `user_email`, `user_birth`, `user_gen`, `crtn_dt`, `mdfc_dt`) VALUES
('qew032', 'apqktmfjqrp12!', '윤성원', '010-6669-7974', 'qew032@naver.com', '1992-03-14', 'M', NOW(), NULL);

-- 3. INSERT 확인
SELECT * FROM tbl_user;

/**********************************************************************************************************
로그인 SELECT 본인의 정보를 조회할 수 있다.
**********************************************************************************************************/
SELECT
    user_id AS '아이디',
    user_phnum AS '핸드폰번호',
    user_email AS '이메일',
    user_birth '생년월일',
    user_gen '성별'
FROM
    tbl_user
WHERE
    user_id = 'qew032'
AND
    user_pw = 'apqktmfjqrp12!';

/**********************************************************************************************************
이름과 이메일 또는 휴대폰 인증을 통해 아이디를 조회할 수 있다.
**********************************************************************************************************/
SELECT
    user_id,
    user_nm
FROM
    tbl_user
WHERE
    user_nm = '윤성원'
AND
    user_email = 'qew032@naver.com';

/**********************************************************************************************************
비밀번호 찾기
**********************************************************************************************************/
UPDATE
    tbl_user
SET
    user_pw = 'rnflapqk12!@'
WHERE
    user_id = 'qew032';

SELECT * FROM tbl_user;

# 