select * from tbl_common_group;


/*************************************************************************************************
회원가입
*************************************************************************************************/

-- 1. 아이디가 중복값이 있는지 (select)
SELECT * FROM tbl_user;
SELECT * FROM tbl_user WHERE user_id = 'qew032';

-- 2. 회원 가입 (insert)
INSERT INTO `tbl_user` (`user_id`, `user_pw`, `user_nm`, `user_phnum`, `user_email`, `user_birth`, `user_gen`, `crtn_dt`, `mdfc_dt`) VALUES
('qew032', 'apqktmfjqrp12!', '윤성원', '010-6669-7974', 'qew032@naver.com', '1992-03-14', 'M', NOW(), NULL);

-- 3. INSERT 확인
SELECT * FROM tbl_user;
/**********************************************************************************************************
로그인 SELECT 본인의 정보를 조회할 수 있다.
**********************************************************************************************************/
SELECT
    user_id AS '아이디',
    user_phnum AS '핸드폰번호',
    user_email AS '이메일',
    user_birth '생년월일',
    user_gen '성별'
FROM
    tbl_user
WHERE
    user_id = 'qew032'
AND
    user_pw = 'apqktmfjqrp12!';



/**********************************************************************************************************
이름과 이메일 또는 휴대폰 인증을 통해 아이디를 조회할 수 있다.
**********************************************************************************************************/
SELECT
    user_id,
    user_nm
FROM
    tbl_user
WHERE
    user_nm = '윤성원'
AND
    user_email = 'qew032@naver.com'
OR
    user_phnum = '010-6669-7974';

/**********************************************************************************************************
비밀번호 찾기 후 재설정
**********************************************************************************************************/
UPDATE
    tbl_user
SET
    user_pw = 'rnflapqk12!@'
WHERE
    user_id = 'qew032';

SELECT * FROM tbl_user;

/**********************************************************************************************************
신고 작성
**********************************************************************************************************/

INSERT INTO `tbl_report` (`content`, `type_code`, `user_code`, `admin_code`, `crtn_dt`, `mdfc_dt`) VALUES
('픽업 기사님이 물건을 함부로 다루셨어요.', 1, 2, 2, DATE_SUB(NOW(), INTERVAL 5 DAY), NULL);

SELECT * FROM tbl_report;

/**********************************************************************************************************
마이페이지 조회
*********************************************************************************************************/
SELECT
    *
FROM
    tbl_user u
JOIN
    tbl_address a ON (u.user_code = a.user_code)
JOIN
    tbl_inquiry i ON (u.user_code = i.user_code)
JOIN
    tbl_pickup_history p ON (u.user_code = p.user_code)
JOIN
    tbl_notification_code n ON (p.pickup_code = n.pickup_code);


/**********************************************************************************************************
마이페이지 수정
*********************************************************************************************************/
UPDATE
    tbl_address
SET
    detail_addr = '서울특별시 강남구 xxx대로'
WHERE
    addr_code = 7;

SELECT * FROM tbl_address;

/**********************************************************************************************************
회원 탈퇴
*********************************************************************************************************/
DELETE FROM tbl_user WHERE user_id = 'qew032';

SELECT * FROM tbl_user;

/**********************************************************************************************************
문의 작성
*********************************************************************************************************/
INSERT INTO `tbl_inquiry` (`inquiry_title`, `inquiry_detail`, `inquiry_stat`, `user_code`, `crtn_dt`, `mdfc_dt`) VALUES
('예약 문의', '일주일 뒤 예약도 가능한지 궁금합니다.', '문의 등록', 10, NOW(), NOW());

SELECT * FROM tbl_inquiry;

/**********************************************************************************************************
리뷰 작성
**********************************************************************************************************/
INSERT INTO `tbl_review` (`review_grade`, `review_detail`, `crtn_dt`, `mdfc_dt`, `driver_code`, `user_code`, `pickup_code`) VALUES
(5, '전체적으로 너무 친절하고 좋았습니다.', NOW(), NULL, 6, 8, 10);

SELECT * FROM tbl_review;

/**********************************************************************************************************
리뷰 조회
**********************************************************************************************************/
SELECT
    review_grade,
    review_detail
FROM
    tbl_review;

